INSERT INTO laokai.department (hospital_id,department_name,parent_id) VALUES
	 (2,'内科',0),
	 (2,'内分泌科',1),
	 (2,'内消化科',1),
	 (2,'中医科',1),
	 (2,'感染科',1),
	 (2,'外科',0),
	 (2,'骨一',6),
	 (2,'疼痛科',6),
	 (2,'普通外科',6),
	 (2,'骨二科',6);
INSERT INTO laokai.department (hospital_id,department_name,parent_id) VALUES
	 (2,'普外科',6);INSERT INTO laokai.doctor (doctor_name,doctor_sex,department_id,doctor_job_title,doctor_status) VALUES
	 ('蒋洋','男',2,0,0),
	 ('祁言','男',2,1,0),
	 ('胥若','女',2,0,0),
	 ('于之','男',4,2,0),
	 ('丁娴','女',7,0,0),
	 ('古秀','女',5,0,0),
	 ('宋巧柔','女',3,2,0),
	 ('石建红','女',3,0,0),
	 ('欧阳进','男',4,0,0),
	 ('孟聪婉','女',7,0,0);INSERT INTO laokai.hospital (hospital_name,hospital_contact,hospital_level,hospital_branch_type,hospital_introduction,hospital_parent_id) VALUES
	 ('医科大附一','19000','三级甲等',1,'福建医科大学附属第一医院',0),
	 ('附一茶亭园区','19002','三级甲等',2,'福建医科大学附属第一医院分院',1),
	 ('附一冰海园区','19004','三级甲等',2,'福建医科大学附属第一医院分院',1),
	 ('附一奥体园区','19006','三级甲等',2,'福建医科大学附属第一医院分院',1),
	 ('LK医院','19992','二甲',1,'这里是医院介绍',0);INSERT INTO laokai.person (username,user_age,mobile,sex,id_card_no,open_id) VALUES
	 ('张三',1,'10086','男','#0001',''),
	 ('李四',2,'11000','男','#0002',''),
	 ('王五',3,'12333','女','#0003',''),
	 ('锴老弟',4,'10000','男','#0004','');INSERT INTO laokai.scheduling (department_id,`date`,start_time,end_time,add_time,scheduling_status) VALUES
	 (2,'2022-01-23','13:00:00','17:00:00','2022-01-21 16:02:50.0',0),
	 (7,'2022-01-24','14:00:00','17:00:00','2022-01-21 16:02:50.0',0),
	 (2,'2022-01-25','09:00:00','11:30:00','2022-01-21 16:03:28.0',0),
	 (2,'2022-01-25','13:00:00','17:00:00','2022-01-21 16:03:28.0',0);INSERT INTO laokai.scheduling_stuff (doctor_id,scheduling_id,start_time,end_time,add_time,department_id,`date`,scheduling_status) VALUES
	 (1,1,'13:00:00','17:00:00','2022-01-23 18:14:37.0',2,'2022-01-23',0),
	 (2,1,'13:00:00','17:00:00','2022-01-23 18:14:37.0',2,'2022-01-23',0),
	 (3,1,'13:00:00','17:00:00','2022-01-23 18:14:37.0',2,'2022-01-23',0),
	 (5,2,'14:00:00','17:00:00','2022-01-23 18:14:37.0',7,'2022-01-24',0),
	 (10,2,'14:00:00','17:00:00','2022-01-23 18:14:37.0',7,'2022-01-24',0),
	 (1,3,'09:00:00','11:30:00','2022-01-23 18:14:37.0',2,'2022-01-25',0),
	 (2,3,'09:00:00','11:30:00','2022-01-23 18:14:37.0',2,'2022-01-25',0),
	 (3,3,'09:00:00','11:30:00','2022-01-23 18:14:37.0',2,'2022-01-25',0),
	 (1,4,'13:00:00','17:00:00','2022-01-23 18:14:38.0',2,'2022-01-25',0),
	 (2,4,'13:00:00','17:00:00','2022-01-23 18:14:38.0',2,'2022-01-25',0);
INSERT INTO laokai.scheduling_stuff (doctor_id,scheduling_id,start_time,end_time,add_time,department_id,`date`,scheduling_status) VALUES
	 (3,4,'13:00:00','17:00:00','2022-01-23 18:14:38.0',2,'2022-01-25',0);